tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "koekeishiya/formulae"
tap "microsoft/git"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "sidneys/homebrew"
tap "universal-ctags/universal-ctags"
brew "glib"
brew "cairo"
brew "libtiff"
brew "icu4c@76"
brew "harfbuzz"
brew "pango"
brew "adwaita-icon-theme"
brew "ansifilter"
brew "giflib"
brew "jpeg-xl"
brew "aom"
brew "ascii"
brew "astyle"
brew "m4"
brew "autoconf"
brew "automake"
brew "avrdude"
brew "awk"
brew "bash"
brew "grpc"
brew "bear"
brew "binutils"
brew "btop"
brew "cabextract"
brew "ccache"
brew "cmake"
brew "cmake-docs"
brew "coreutils"
brew "ctags"
brew "diffutils"
brew "dos2unix"
brew "doxygen"
brew "fetch"
brew "figlet"
brew "findutils"
brew "flex"
brew "fzf"
brew "gawk"
brew "gcc"
brew "gh"
brew "tesseract"
brew "git"
brew "git-lfs"
brew "glfw"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-which"
brew "gnutls"
brew "gnupg"
brew "go"
brew "gpatch"
brew "gpgme"
brew "libtool"
brew "grep"
brew "grip"
brew "gzip"
brew "hcxtools"
brew "ncurses"
brew "htop"
brew "libheif"
brew "libraw"
brew "imagemagick"
brew "iproute2mac"
brew "jpeg"
brew "less"
brew "libexif"
brew "librist"
brew "lua@5.3"
brew "luarocks"
brew "make"
brew "midnight-commander"
brew "mingw-w64"
brew "mono"
brew "mono-libgdiplus"
brew "most"
brew "mysql"
brew "neovim"
brew "neovim-remote"
brew "nmap"
brew "node"
brew "openal-soft"
brew "openjdk"
brew "openssh"
brew "pandoc"
brew "pkgconf"
brew "plantuml"
brew "pyenv"
brew "pygments"
brew "python@3.11"
brew "python-tk@3.11"
brew "python@3.10"
brew "python@3.9"
brew "qemu"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "rogue"
brew "rpm"
brew "rust"
brew "samba"
brew "screen"
brew "sfml"
brew "swi-prolog"
brew "switchaudio-osx"
brew "tig"
brew "tmate"
brew "tmux"
brew "tree"
brew "unzip"
brew "viu"
brew "w3m"
brew "watch"
brew "wdiff"
brew "wget"
brew "youtube-dl"
brew "zip"
brew "zplug"
brew "zsh"
brew "osx-cross/avr/avr-gcc@9"
cask "alacritty"
cask "android-file-transfer"
cask "android-ndk"
cask "android-platform-tools"
cask "appcleaner"
cask "audacity"
cask "audiorelay"
cask "autodesk-fusion"
cask "balenaetcher"
cask "blackhole-2ch"
cask "clean-me"
cask "coconutbattery"
cask "deepl"
cask "dotnet-sdk"
cask "drawio"
cask "enjoyable"
cask "firefox"
cask "font-iosevka"
cask "freecad"
cask "genymotion"
cask "gimp"
cask "git-credential-manager"
cask "git-credential-manager"
cask "github"
cask "handbrake"
cask "hiddenbar"
cask "iina"
cask "imageoptim"
cask "inkscape"
cask "karabiner-elements"
cask "keyboardcleantool"
cask "keycastr"
cask "logi-options+"
cask "logmein-hamachi"
cask "macdown"
cask "macmediakeyforwarder"
cask "mactex-no-gui"
cask "min"
cask "monitorcontrol"
cask "mono-mdk"
cask "mos"
cask "ngrok"
cask "nvidia-geforce-now"
cask "omnidisksweeper"
cask "prismlauncher"
cask "qbittorrent"
cask "rar"
cask "simplenote"
cask "skim"
cask "stats"
cask "steam"
cask "supertuxkart"
cask "telegram"
cask "utm"
cask "wezterm"
cask "xonotic"
cask "xquartz"
cask "zulu@17"
cask "zulu@17"
