tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "microsoft/git"
tap "sidneys/homebrew"
tap "universal-ctags/universal-ctags"
# List ASCII idiomatic names and octal/decimal code-point forms
brew "ascii"
# Macro processing language
brew "m4"
# Automatic configure script builder
brew "autoconf"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# GNU binary tools for native development
brew "binutils"
# Extract files from Microsoft cabinet files
brew "cabextract"
# Object-file caching compiler wrapper
brew "ccache"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# File comparison utilities
brew "diffutils"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Classic UNIX line editor
brew "ed"
# Download assets from a commit, branch, or tag of GitHub repositories
brew "fetch"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Fast Lexical Analyzer, generates Scanners (tokenizers)
brew "flex"
# GNU awk utility
brew "gawk"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# C code prettifier
brew "gnu-indent"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# GNU implementation of which utility
brew "gnu-which"
# Cross-platform application and UI framework
brew "qt@5"
# Command-driven, interactive function plotting
brew "gnuplot"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Apply a diff file to an original
brew "gpatch"
# GNU grep, egrep and fgrep
brew "grep"
# Generic syntax highlighter
brew "pygments"
# GitHub Markdown previewer
brew "grip"
# Popular GNU data compression program
brew "gzip"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Library for reading RAW files from digital photo cameras
brew "libraw"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# CLI wrapper for basic network utilities on macOS - ip command
brew "iproute2mac"
# Text-based UI library
brew "ncurses"
# Pager program similar to more
brew "less"
# Utility for directing compilation
brew "make"
# Terminal-based visual file manager
brew "midnight-commander"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Control nvim processes using `nvr` command-line tool
brew "neovim-remote"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# Development kit for the Java programming language
brew "openjdk"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Standard unix software packaging tool
brew "rpm"
# Safe, concurrent, practical language
brew "rust"
# Terminal multiplexer with VT100/ANSI terminal emulation
brew "screen"
# Multi-media library with bindings for multiple languages
brew "sfml"
# ISO/Edinburgh-style Prolog interpreter
brew "swi-prolog"
# Change macOS audio source from the command-line
brew "switchaudio-osx"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extraction utility for .zip compressed archives
brew "unzip"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Display word differences between text files
brew "wdiff"
# Internet file retriever
brew "wget"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Compression and file packaging/archive utility
brew "zip"
# UNIX shell (command interpreter)
brew "zsh"
# Maintained ctags implementation
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
# Transfer files from and to an Android smartphone
cask "android-file-transfer"
# Android SDK component
cask "android-platform-tools"
# Application uninstaller
cask "appcleaner"
# Multi-track audio editor and recorder
cask "audacity"
# 3D creation suite
cask "blender"
# Private rolodex to remember people better
cask "clay"
# Draw.io is free online diagram software
cask "drawio"
# Book reader
cask "fbreader"
# Solve, save and share math problems, graph functions, etc
cask "geogebra"
cask "git-credential-manager-core"
# Desktop client for GitHub repositories
cask "github"
# Open-source video transcoder
cask "handbrake"
# Utility to hide menu bar items
cask "hiddenbar"
# Tool to optimize images to a smaller size
cask "imageoptim"
# Blocks all Keyboard and TouchBar input
cask "keyboardcleantool"
# Media key forwarder for iTunes and Spotify
cask "macmediakeyforwarder"
# Full TeX Live distribution with GUI applications
cask "mactex"
# Open-source software for live streaming and screen recording
cask "obs"
# Physics sandbox game
cask "powder"
# Minecraft launcher
cask "prismlauncher"
# Peer to peer Bitorrent client
cask "qbittorrent"
# Archive manager for data compression and backups
cask "rar"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Tool to manage the size and position of windows
cask "shiftit"
# PDF reader and note-taking application
cask "skim"
# System monitor for the menu bar
cask "stats"
# LaTeX editor
cask "texstudio"
# Virtual machines UI using QEMU
cask "utm"
# Multimedia player
cask "vlc"
# OpenJDK distribution from Azul
cask "zulu17"
