tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "microsoft/git"
tap "sidneys/homebrew"
tap "universal-ctags/universal-ctags"
brew "glib"
brew "pkg-config"
brew "cairo"
brew "libtiff"
brew "harfbuzz"
brew "pango"
brew "ansifilter"
brew "giflib"
brew "ascii"
brew "m4"
brew "autoconf"
brew "automake"
brew "awk"
brew "bash"
brew "binutils"
brew "cabextract"
brew "ccache"
brew "cmake"
brew "coreutils"
brew "ctags"
brew "diffutils"
brew "fetch"
brew "figlet"
brew "findutils"
brew "flex"
brew "fzf"
brew "gawk"
brew "gcc"
brew "gh"
brew "git"
brew "git-lfs"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-which"
brew "go"
brew "gpatch"
brew "grep"
brew "pygments"
brew "grip"
brew "python@3.11"
brew "gzip"
brew "libheif"
brew "libraw"
brew "libtool"
brew "imagemagick"
brew "iproute2mac"
brew "jpeg"
brew "ncurses"
brew "less"
brew "libexif"
brew "lua@5.3"
brew "luarocks"
brew "make"
brew "midnight-commander"
brew "mono"
brew "mono-libgdiplus"
brew "mysql"
brew "neovim"
brew "neovim-remote"
brew "nmap"
brew "node"
brew "openjdk"
brew "openssh"
brew "python-tk@3.11"
brew "python@3.10"
brew "qemu"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "rpm"
brew "rust"
brew "screen"
brew "swi-prolog"
brew "switchaudio-osx"
brew "tesseract"
brew "tmate"
brew "tmux"
brew "tree"
brew "unzip"
brew "viu"
brew "w3m"
brew "watch"
brew "wdiff"
brew "wget"
brew "youtube-dl"
brew "zip"
brew "zplug"
brew "zsh"
cask "alacritty"
cask "android-file-transfer"
cask "android-platform-tools"
cask "appcleaner"
cask "audacity"
cask "autodesk-fusion360"
cask "balenaetcher"
cask "coconutbattery"
cask "dotnet-sdk"
cask "drawio"
cask "enjoyable"
cask "freecad"
cask "gimp"
cask "git-credential-manager-core"
cask "github"
cask "handbrake"
cask "hiddenbar"
cask "iina"
cask "imageoptim"
cask "inkscape"
cask "karabiner-elements"
cask "keyboardcleantool"
cask "keycastr"
cask "logi-options-plus"
cask "logmein-hamachi"
cask "macdown"
cask "macmediakeyforwarder"
cask "mactex"
cask "monitorcontrol"
cask "mono-mdk"
cask "mos"
cask "ngrok"
cask "powder"
cask "prismlauncher"
cask "qbittorrent"
cask "rar"
cask "rectangle"
cask "simplenote"
cask "skim"
cask "stats"
cask "steam"
cask "supertuxkart"
cask "telegram"
cask "utm"
cask "xonotic"
cask "zulu17"
